app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "anders"]]
---
  def attempt_login
  	if params[:username].present? && params[:password].present?
      found_user = User.where(username: params[:username]).first