app/controllers/superheroes_controller.rb

  def index
  	@superheroes = Superhero.all
---
SELECT "superheros".* FROM "superheros"

  def new
  	@superhero = Superhero.new
  	@teams = Team.all
---
SELECT "teams".* FROM "teams"

 	def edit
 		@teams = Team.all
---
SELECT "teams".* FROM "teams"

  def destroy
  	@superhero.destroy
---
DELETE FROM "superheros" WHERE "superheros"."id" = $1  [["id", 43]]

  def set_superhero
  	@superhero = Superhero.find_by(id: params[:id])
---
SELECT  "superheros".* FROM "superheros" WHERE "superheros"."id" = $1 LIMIT 1  [["id", 43]]