app/controllers/teams_controller.rb

SELECT "superheros".* FROM "superheros"
---
  def new
  	@team = Team.new
  	@superheroes = Superhero.all

INSERT INTO "teams" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Team"], ["description", "Test"], ["created_at", "2015-07-20 02:24:14.260163"], ["updated_at", "2015-07-20 02:24:14.260163"]]
---
  def create
  	@team = Team.create(team_params)

SELECT "superheros".* FROM "superheros"
---
  def edit
  	@superheroes = Superhero.all

UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "All-Star Squadron Test2"], ["updated_at", "2015-07-20 02:30:33.398213"], ["id", 19]]
---
  def update
  	@team.update(team_params)

DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 25]]
---
  def destroy
  	@team.destroy

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 25]]
---
  	def set_team
  		@team = Team.find_by(id: params[:id])